import { IQuestion } from "@interfaces/IQuestion";

export const arithTest: IQuestion[] = [
  {
    title:
      "Какое действие выполняется арифметико-логическим устройством (АЛУ)?",
    currectAnswer: ["Все перечисленное"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Сложение",
      "Умножение",
      "Перемещение данных",
      "Все перечисленное",
    ],
  },
  {
    title: "Что такое бит?",
    currectAnswer: ["Минимальная единица информации"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Базовая единица хранения данных в ЭВМ",
      "Минимальная единица информации",
      "Устройство для чтения данных",
      "Программа для обработки данных",
    ],
  },
  {
    title: "Как осуществляется сложение двоичных чисел?",
    currectAnswer: ["Побитово"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Побитово",
      "Последовательно",
      "Параллельно",
      "Через специальное ПО",
    ],
  },
  {
    title: "Что такое перенос в контексте сложения двоичных чисел?",
    currectAnswer: ["Дополнительный бит, добавляемый к следующему разряду"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Ошибка вычисления",
      "Дополнительный бит, добавляемый к следующему разряду",
      "Удаление лишнего бита",
      "Смена алгоритма сложения",
    ],
  },
  {
    title:
      "Какие числа могут быть представлены в ЭВМ для выполнения операции сложения?",
    currectAnswer: ["Целые и дробные"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Только положительные",
      "Только целые",
      "Целые и дробные",
      "Только натуральные",
    ],
  },
  {
    title: "Какое максимальное число бит может быть в слове ЭВМ?",
    currectAnswer: ["Зависит от архитектуры ЭВМ"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: ["8", "16", "Зависит от архитектуры ЭВМ", "32"],
  },
  {
    title:
      "Как называется наименьшая единица памяти, используемая для хранения одного символа в компьютере?",
    currectAnswer: ["Байт"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: ["Килобайт", "Байт", "Бит", "Мегабайт"],
  },
  {
    title:
      "Какой из следующих методов используется для сложения многоразрядных чисел в ЭВМ?",
    currectAnswer: ["Метод последовательного переноса"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Метод Монте-Карло",
      "Метод последовательного переноса",
      "Параллельное сложение без переноса",
      "Метод деления",
    ],
  },
  {
    title:
      "Как обычно обозначается операция сложения в языках программирования?",
    currectAnswer: ["Знак +"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: ["Знак +", "Знак &", "Знак #", "Знак @"],
  },
  {
    title: "Какое минимальное количество бит требуется для хранения числа 256?",
    currectAnswer: ["9 бит"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: ["8 бит", "9 бит", "10 бит", "7 бит"],
  },
  {
    title:
      "Как называется операция сложения, при которой используется дополнительный бит переноса?",
    currectAnswer: ["Сложение с переносом"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Модифицированное сложение",
      "Сложение с переносом",
      "Расширенное сложение",
      "Усиленное сложение",
    ],
  },
  {
    title:
      "Что произойдет, если при сложении двух чисел произойдет переполнение?",
    currectAnswer: ["Верхние разряды будут утеряны"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Результат будет умножен на два",
      "Верхние разряды будут утеряны",
      "Система зависнет",
      "Результат обнулится",
    ],
  },
  {
    title: "Как называется самая младшая цифра в двоичном числе?",
    currectAnswer: ["Младший бит"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Максимальный бит",
      "Младший бит",
      "Старший бит",
      "Базовый бит",
    ],
  },
  {
    title: "Каковы основные шаги сложения двух двоичных чисел?",
    currectAnswer: ["Сложение соответствующих бит, обработка переноса"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Сложение соответствующих бит, обработка переноса",
      "Перемножение бит, добавление результатов",
      "Сравнение бит, выбор наибольшего",
      "Сложение, умножение на базу",
    ],
  },
  {
    title: "Чем отличается сложение чисел в ЭВМ от сложения на бумаге?",
    currectAnswer: ["Сложение выполняется в двоичной системе"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Сложение выполняется в двоичной системе",
      "В ЭВМ используются только десятичные числа",
      "На бумаге сложение более точное",
      "В ЭВМ невозможно сложение отрицательных чисел",
    ],
  },
  {
    title:
      "Какой бит в двоичной системе является знаковым при использовании дополнительного кода?",
    currectAnswer: ["Последний слева"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Первый слева",
      "Последний слева",
      "Первый справа",
      "Последний справа",
    ],
  },
  {
    title: "Какое из следующих утверждений о сложении двоичных чисел неверно?",
    currectAnswer: ["Двоичное сложение не требует АЛУ"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Сложение начинается с младших битов",
      "При сложении могут использоваться промежуточные переносы",
      "Двоичное сложение не требует АЛУ",
      "Сложение двоичных чисел может привести к переполнению",
    ],
  },
  {
    title:
      "Какой метод сложения использует предварительный расчет возможных переносов для ускорения процесса?",
    currectAnswer: ["Метод предварительного просмотра переносов"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Метод последовательного переноса",
      "Метод Монте-Карло",
      "Метод предварительного просмотра переносов",
      "Параллельное сложение",
    ],
  },
  {
    title:
      "Как называется процесс выполнения арифметических операций без сохранения промежуточных результатов в памяти?",
    currectAnswer: ["Онлайн-вычисление"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Онлайн-вычисление",
      "Оффлайн-вычисление",
      "Кэширование",
      "Прямое сложение",
    ],
  },
  {
    title: 'Что такое "переполнение регистра" при сложении чисел?',
    currectAnswer: [
      "Превышение максимально возможного значения, которое может быть представлено в регистре ",
    ],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Превышение максимально возможного значения, которое может быть представлено в регистре ",
      "Удаление данных из регистра",
      "Повреждение регистра",
      "Перегрев регистра",
    ],
  },
  {
    title:
      "Какие последствия может иметь игнорирование бита переноса при сложении?",
    currectAnswer: ["Получение неверного результата"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Увеличение скорости вычислений",
      "Уменьшение объема используемой памяти",
      "Получение неверного результата",
      "Улучшение точности вычислений",
    ],
  },
  {
    title:
      "Какова основная функция регистра флагов в контексте арифметических операций?",
    currectAnswer: ["Индикация состояний, таких как переполнение"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Хранение промежуточных результатов",
      "Индикация состояний, таких как переполнение",
      "Сохранение входных данных операции",
      "Хранение конечного результата",
    ],
  },
  {
    title:
      "Как называется регистр, используемый для хранения промежуточного бита переноса в процессе сложения?",
    currectAnswer: ["Регистр флагов"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Регистр данных",
      "Регистр флагов",
      "Регистр состояний",
      "Командный регистр",
    ],
  },
  {
    title: "Какое из нижеперечисленных утверждений о переносе битов верно?",
    currectAnswer: [
      "Бит переноса может быть передан в следующий старший разряд",
    ],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Бит переноса может быть передан в следующий старший разряд",
      "Бит переноса всегда отбрасывается",
      "Бит переноса никогда не влияет на результат",
      "Бит переноса используется только при умножении",
    ],
  },
  {
    title:
      "Что происходит, если при сложении двух чисел в двоичной системе происходит перенос из старшего разряда?",
    currectAnswer: ["Происходит переполнение"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Результат записывается в дополнительный регистр",
      "Происходит переполнение",
      "Система переходит в режим ожидания",
      "Результат делится на два",
    ],
  },
  {
    title:
      "Какое значение имеет бит переноса, если он активирован в результате сложения?",
    currectAnswer: ["1"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: ["1", "0", "2", "Значение зависит от операции"],
  },
  {
    title:
      "Какой процесс в арифметике ЭВМ чаще всего использует алгоритм сложения?",
    currectAnswer: ["Сложение и вычитание"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Вычитание",
      "Сложение и вычитание",
      "Умножение",
      "Деление",
    ],
  },
  {
    title:
      'Какова основная цель использования алгоритма "глядя вперед" при сложении чисел?',
    currectAnswer: ["Уменьшение времени, необходимого для сложения"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Уменьшение количества используемой памяти",
      "Уменьшение времени, необходимого для сложения",
      "Увеличение точности результатов",
      "Упрощение программного кода",
    ],
  },
  {
    title: "Как влияет размер слова ЭВМ на операцию сложения?",
    currectAnswer: [
      "Определяет максимальное число, которое можно сложить без переполнения",
    ],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Никак не влияет",
      "Определяет максимальное число, которое можно сложить без переполнения",
      "Увеличивает скорость сложения",
      "Снижает точность вычислений",
    ],
  },
  {
    title: "Что такое двоичное сложение без знака?",
    currectAnswer: ["Сложение, при котором не учитывается знак чисел"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Сложение, которое учитывает только положительные числа",
      "Сложение, при котором не учитывается знак чисел",
      "Сложение с автоматическим отбрасыванием переноса",
      "Сложение, выполняемое без использования АЛУ",
    ],
  },
  {
    title: "Что такое множитель в контексте умножения чисел в ЭВМ?",
    currectAnswer: ["Число, которое умножается на другое число"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Число, на которое умножается другое число",
      "Результат умножения",
      "Число, которое умножается на другое число",
      "Число, которое делится на другое число",
    ],
  },
  {
    title: "Какое из устройств ЭВМ осуществляет операцию умножения?",
    currectAnswer: ["Арифметико-логическое устройство (АЛУ)"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Устройство ввода",
      "Устройство вывода",
      "Арифметико-логическое устройство (АЛУ)",
      "Блок управления",
    ],
  },
  {
    title: "Какие числа могут быть перемножены в ЭВМ?",
    currectAnswer: ["Любые числа, включая отрицательные и дробные"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Только положительные",
      "Любые числа, включая отрицательные и дробные",
      "Только целые",
      "Только натуральные",
    ],
  },
  {
    title: "Каков основной принцип умножения в двоичной системе?",
    currectAnswer: ["Побитовое сложение и сдвиг"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Сложение",
      "Побитовое сложение и сдвиг",
      "Подсчет количества бит",
      "Использование логических операторов",
    ],
  },
  {
    title: "Что такое частичное произведение в умножении двоичных чисел?",
    currectAnswer: ["Промежуточный результат умножения"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Промежуточный результат деления",
      "Промежуточный результат умножения",
      "Конечный результат умножения",
      "Начальное значение множителя",
    ],
  },
  {
    title:
      "Какое действие выполняется при умножении чисел в ЭВМ для каждого бита множителя?",
    currectAnswer: ["Сдвиг и сложение"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Инкремент",
      "Сдвиг и сложение",
      "Декремент",
      "Логическое умножение",
    ],
  },
  {
    title: "Какие алгоритмы используются для умножения в современных ЭВМ?",
    currectAnswer: ["Бутстреппинг, умножение Карацубы"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Бутстреппинг, умножение Карацубы",
      "Умножение по методу Монте-Карло",
      "Простое последовательное умножение",
      "Рекурсивное умножение",
    ],
  },
  {
    title: "Что такое умножение с использованием Booth's Algorithm?",
    currectAnswer: ["Алгоритм для умножения двоичных чисел"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Метод умножения для десятичных чисел",
      "Алгоритм для умножения двоичных чисел",
      "Способ умножения матриц",
      "Умножение с плавающей запятой",
    ],
  },
  {
    title:
      "Какой метод умножения позволяет умножать числа с плавающей запятой?",
    currectAnswer: ["Умножение с плавающей запятой"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Умножение с фиксированной запятой",
      "Умножение с плавающей запятой",
      "Умножение с использованием переносов",
      "Умножение с использованием фиксированных точек",
    ],
  },
  {
    title: "Что такое переполнение при умножении чисел в ЭВМ?",
    currectAnswer: [
      "Превышение максимально возможного значения, которое может быть представлено",
    ],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Превышение максимально возможного значения, которое может быть представлено",
      "Ошибка вычисления",
      "Умножение нулевых значений",
      "Произведение двух отрицательных чисел, дающее положительный результат",
    ],
  },
  {
    title: "Чем отличается умножение в ЭВМ от умножения на бумаге?",
    currectAnswer: ["В ЭВМ выполняется в двоичной системе"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "В ЭВМ выполняется в двоичной системе",
      "В ЭВМ используются только десятичные числа",
      "На бумаге умножение более точное",
      "В ЭВМ невозможно умножение отрицательных чисел",
    ],
  },
  {
    title:
      "Какой бит в двоичной системе обычно используется для обозначения знака числа при умножении с использованием дополнительного кода?",
    currectAnswer: ["Последний слева"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Первый слева",
      "Последний слева",
      "Первый справа",
      "Последний справа",
    ],
  },
  {
    title:
      "Какое устройство обычно используется для умножения чисел в суперкомпьютерах?",
    currectAnswer: ["Арифметический сопроцессор"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Микропроцессор",
      "Арифметический сопроцессор",
      "Видеокарта",
      "Сетевая карта",
    ],
  },
  {
    title: "Каковы основные шаги умножения двух двоичных чисел?",
    currectAnswer: ["Сложение частичных произведений, сдвиг вправо"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Сложение частичных произведений, сдвиг вправо",
      "Перемножение бит, добавление результатов",
      "Сравнение бит, выбор наибольшего",
      "Умножение, деление на основание",
    ],
  },
  {
    title: "Как влияет размер слова ЭВМ на операцию умножения?",
    currectAnswer: [
      "Определяет максимальное число, которое можно умножить без переполнения",
    ],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Никак не влияет",
      "Определяет максимальное число, которое можно умножить без переполнения",
      "Увеличивает скорость умножения",
      "Снижает точность вычислений",
    ],
  },
  {
    title: "Что такое умножение без знака в контексте двоичных чисел?",
    currectAnswer: ["Умножение, при котором не учитывается знак чисел"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Умножение, которое учитывает только положительные числа",
      "Умножение, при котором не учитывается знак чисел",
      "Умножение с автоматическим отбрасыванием переноса",
      "Умножение, выполняемое без использования АЛУ",
    ],
  },
  {
    title:
      "Какие последствия может иметь игнорирование переполнения при умножении?",
    currectAnswer: ["Получение неверного результата"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Увеличение скорости вычислений",
      "Уменьшение объема используемой памяти",
      "Получение неверного результата",
      "Улучшение точности вычислений",
    ],
  },
  {
    title:
      "Какой алгоритм умножения использует технику удвоения для ускорения процесса?",
    currectAnswer: ["Удвоение и сложение"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Умножение с плавающей запятой",
      "Удвоение и сложение",
      "Умножение Карацубы",
      "Бутстреппинг",
    ],
  },
  {
    title: "Какие типы данных поддерживают операцию умножения в ЭВМ?",
    currectAnswer: ["Целочисленные и числа с плавающей запятой"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Только целочисленные",
      "Целочисленные и числа с плавающей запятой",
      "Только данные с плавающей запятой",
      "Только текстовые данные",
    ],
  },
  {
    title:
      "Какие проблемы могут возникнуть при умножении очень больших чисел в ЭВМ?",
    currectAnswer: ["Переполнение и потеря точности"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Невозможность выполнения операции",
      "Переполнение и потеря точности",
      "Значительное увеличение времени выполнения",
      "Автоматическое округление результатов",
    ],
  },
  {
    title: "Что такое симметричное умножение в контексте архитектуры ЭВМ?",
    currectAnswer: [
      "Умножение, использующее одновременное использование нескольких АЛУ",
    ],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Умножение, при котором учитывается симметрия данных",
      "Умножение, при котором результат всегда симметричен относительно нуля",
      "Умножение, использующее одновременное использование нескольких АЛУ",
      "Умножение, при котором произведение множителей всегда равно",
    ],
  },
  {
    title:
      "Как влияет использование параллельного умножения на производительность ЭВМ?",
    currectAnswer: [
      "Увеличивает производительность, позволяя выполнять множество операций одновременно",
    ],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Уменьшает производительность из-за сложности операций",
      "Никак не влияет на производительность",
      "Увеличивает производительность, позволяя выполнять множество операций одновременно",
      "Снижает точность вычислений",
    ],
  },
  {
    title:
      "Какое устройство обычно используется для умножения чисел в микроконтроллерах?",
    currectAnswer: ["Интегрированное в ЦПУ арифметико-логическое устройство"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Специализированный процессор умножения",
      "Интегрированное в ЦПУ арифметико-логическое устройство",
      "Внешний арифметический модуль",
      "Периферийное устройство ввода-вывода",
    ],
  },
  {
    title:
      "Какой тип умножения чаще всего используется в графических процессорах (GPU)?",
    currectAnswer: ["Умножение с плавающей запятой"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Умножение с фиксированной запятой",
      "Умножение с плавающей запятой",
      "Целочисленное умножение",
      "Умножение полиномов",
    ],
  },
  {
    title:
      "Какой алгоритм умножения наиболее эффективен для чисел большой разрядности?",
    currectAnswer: ["Умножение Карацубы"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Традиционное школьное умножение",
      "Умножение с использованием АЛУ",
      "Умножение Карацубы",
      "Простое последовательное умножение",
    ],
  },
  {
    title:
      "Какие из следующих утверждений верны относительно умножения с плавающей запятой?",
    currectAnswer: ["Оно может привести к потере точности из-за округления"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Оно всегда точное",
      "Оно используется только в научных расчетах",
      "Оно может привести к потере точности из-за округления",
      "Оно выполняется без использования аппаратных средств",
    ],
  },
  {
    title: "Чем характеризуется умножение в векторных процессорах?",
    currectAnswer: ["Одновременное выполнение множества операций умножения"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Выполнение только целочисленных операций",
      "Использование только одного АЛУ",
      "Одновременное выполнение множества операций умножения",
      "Невозможность использования с плавающей запятой",
    ],
  },
  {
    title:
      "Какие методы умножения используются для оптимизации процесса в микропроцессорах?",
    currectAnswer: [
      "Умножение с использованием таблиц быстрого доступа и аппаратных средств",
    ],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Умножение по методу пирамиды",
      "Умножение с использованием таблиц быстрого доступа и аппаратных средств",
      "Только программное умножение",
      "Умножение без использования специализированных инструкций",
    ],
  },
  {
    title: "Какие факторы могут влиять на скорость умножения в ЭВМ?",
    currectAnswer: ["Размер операндов и архитектура процессора"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Только размер операндов",
      "Только архитектура процессора",
      "Размер операндов и архитектура процессора",
      "Только наличие или отсутствие сетевого подключения",
    ],
  },
  {
    title:
      "Как аппаратное ускорение влияет на умножение чисел в современных ЭВМ?",
    currectAnswer: ["Повышает скорость выполнения операций умножения"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Уменьшает количество необходимых операций",
      "Увеличивает количество возможных ошибок",
      "Повышает скорость выполнения операций умножения",
      "Не оказывает влияния на процесс умножения",
    ],
  },
];

export const compareTest: IQuestion[] = [
  {
    title: "Что такое сравнение чисел в контексте ЭВМ?",
    currectAnswer: [
      "Определение отношения между числами (больше, меньше, равно)",
    ],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Определение равенства чисел",
      "Определение отношения между числами (больше, меньше, равно)",
      "Преобразование чисел из одного формата в другой",
      "Сложение чисел",
    ],
  },
  {
    title: "Какое устройство ЭВМ обычно выполняет операции сравнения?",
    currectAnswer: ["Арифметико-логическое устройство (АЛУ)"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Устройство хранения данных",
      "Арифметико-логическое устройство (АЛУ)",
      "Управляющий блок",
      "Устройство вывода",
    ],
  },
  {
    title:
      "Какие типы результатов обычно возвращаются при сравнении чисел в ЭВМ?",
    currectAnswer: ["Больше, меньше, равно"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Больше, меньше, равно",
      "Точное значение",
      "Процентное соотношение",
      "Сумма чисел",
    ],
  },
  {
    title: "Что такое флаг нуля в контексте сравнения чисел?",
    currectAnswer: ["Индикатор того, что результат сравнения равен нулю"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Индикатор того, что результат сравнения равен нулю",
      "Показатель того, что оба числа нулевые",
      "Ошибка сравнения",
      "Флаг переполнения",
    ],
  },
  {
    title:
      "Какой флаг используется для указания того, что одно число больше другого при сравнении в ЭВМ?",
    currectAnswer: ["Флаг знака"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Флаг нуля",
      "Флаг знака",
      "Флаг переноса",
      "Флаг переполнения",
    ],
  },
  {
    title: "Что такое условные переходы в контексте сравнения чисел?",
    currectAnswer: [
      "Изменение потока выполнения программы в зависимости от результата сравнения",
    ],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Перемещение данных из одного места в другое",
      "Изменение потока выполнения программы в зависимости от результата сравнения",
      "Пересчет значений",
      "Оптимизация кода",
    ],
  },
  {
    title: "Как сравниваются числа с плавающей запятой в ЭВМ?",
    currectAnswer: ["По их порядку и мантиссе отдельно"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "По их абсолютным значениям",
      "По их порядку и мантиссе отдельно",
      "Только по мантиссе",
      "Только по порядку",
    ],
  },
  {
    title:
      "Какой оператор обычно используется в программировании для сравнения равенства двух чисел?",
    currectAnswer: ["=="],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [">", "<", "==", "!="],
  },
  {
    title: "Что такое ассемблерные директивы сравнения?",
    currectAnswer: ["Инструкции для выполнения сравнения регистров"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Команды для перемещения данных",
      "Инструкции для выполнения сравнения регистров",
      "Указания по оптимизации кода",
      "Методы управления памятью",
    ],
  },
  {
    title: "Как работает операция сравнения в ассемблере?",
    currectAnswer: ["Меняет значения флагов в регистре состояний"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Изменяет данные в памяти",
      "Меняет значения флагов в регистре состояний",
      "Перемещает значения между регистрами",
      "Удаляет данные из регистра",
    ],
  },
  {
    title:
      "Как влияет сравнение на выполнение условных операторов в программировании?",
    currectAnswer: ["Определяет, какой блок кода будет выполнен далее"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Никак не влияет",
      "Определяет, какой блок кода будет выполнен далее",
      "Ускоряет выполнение программы",
      "Замедляет выполнение программы",
    ],
  },
  {
    title: "Какова цель использования оператора '!=' в программировании?",
    currectAnswer: ["Проверить, не равны ли два числа друг другу"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Проверить, являются ли два числа равными",
      "Проверить, не равны ли два числа друг другу",
      "Сравнить числа по модулю",
      "Сложить два числа",
    ],
  },
  {
    title: "Что такое битовое сравнение?",
    currectAnswer: ["Сравнение каждого бита двух чисел"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Сравнение размеров двух чисел",
      "Сравнение каждого бита двух чисел",
      "Сложение двух чисел",
      "Вычитание двух чисел",
    ],
  },
  {
    title:
      "Какие флаги в регистре состояний чаще всего используются при сравнении чисел?",
    currectAnswer: ["Флаг знака и флаг нуля"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Флаг переноса и флаг переполнения",
      "Флаг знака и флаг нуля",
      "Флаг деления на ноль и флаг ошибки",
      "Флаг четности и флаг аджаста",
    ],
  },
  {
    title:
      "Чем отличается сравнение целых чисел от сравнения чисел с плавающей запятой в ЭВМ?",
    currectAnswer: [
      "Числа с плавающей запятой требуют сравнения порядков и мантисс",
    ],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Используется разная арифметика",
      "Числа с плавающей запятой требуют сравнения порядков и мантисс",
      "Целые числа сравниваются побитово",
      "Сравнение целых чисел всегда быстрее",
    ],
  },
  {
    title: "Какие два основных метода сравнения используются в ЭВМ?",
    currectAnswer: [
      "Прямое сравнение и сравнение с использованием дополнительных алгоритмов",
    ],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Прямое сравнение и сравнение с использованием дополнительных алгоритмов",
      "Сравнение путем сложения и вычитания",
      "Сравнение через переносы и без переносов",
      "Сравнение методом деления",
    ],
  },
  {
    title:
      "Что такое нормализация в контексте сравнения чисел с плавающей запятой?",
    currectAnswer: [
      "Процесс приведения чисел к стандартной форме для сравнения",
    ],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Процесс уменьшения значений чисел",
      "Процесс приведения чисел к стандартной форме для сравнения",
      "Увеличение значений чисел",
      "Процесс округления чисел",
    ],
  },
  {
    title: "Как сравниваются знаковые и беззнаковые числа в ЭВМ?",
    currectAnswer: [
      "Используются разные методики с учетом наличия или отсутствия знака",
    ],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Используются разные методики с учетом наличия или отсутствия знака",
      "Сравниваются одинаково, без различий",
      "Беззнаковые числа сравниваются быстрее",
      "Знаковые числа всегда считаются больше",
    ],
  },
  {
    title: "Как процессор определяет, что одно число меньше другого?",
    currectAnswer: [
      "Сравнивает числа и устанавливает соответствующий флаг в регистре состояний",
    ],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Сравнивает числа и устанавливает соответствующий флаг в регистре состояний",
      "Выполняет умножение и анализирует результат",
      "Проводит итерационное сложение",
      "Использует специальный регистр сравнения",
    ],
  },
  {
    title:
      "Что происходит, если сравниваются два числа и оба оказываются равны?",
    currectAnswer: ["Устанавливается флаг нуля "],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Устанавливается флаг нуля",
      "Устанавливается флаг переполнения",
      "Процессор переходит в режим ожидания",
      "Выполняется перезагрузка регистра состояний",
    ],
  },
  {
    title:
      "Какие особенности сравнения чисел можно отметить при использовании различных архитектур процессоров?",
    currectAnswer: [
      "Разные процессоры могут использовать различные наборы инструкций и методы сравнения",
    ],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Разные процессоры могут использовать различные наборы инструкций и методы сравнения",
      "Все процессоры используют один и тот же алгоритм",
      "Разные процессоры сравнивают числа с разной скоростью, но методы одинаковы",
      "Различия между процессорами не влияют на сравнение",
    ],
  },
  {
    title: "Что такое флаг четности и как он используется при сравнении чисел?",
    currectAnswer: [
      "Используется для определения четности количества единичных битов в результате",
    ],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Показывает, четное или нечетное число результат",
      "Используется для определения четности количества единичных битов в результате",
      "Определяет, было ли число умножено на два",
      "Фиксирует ошибку в данных при сравнении",
    ],
  },
  {
    title: "Какое влияние на сравнение чисел оказывает регистр флагов?",
    currectAnswer: [
      "Он хранит результаты сравнения, такие как флаги нуля, переноса и знака",
    ],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Никакого, регистр флагов не участвует в сравнении",
      "Он хранит результаты сравнения, такие как флаги нуля, переноса и знака",
      "Он определяет скорость сравнения",
      "Он хранит исходные данные для сравнения",
    ],
  },
  {
    title: "Как обычно производится сравнение больших чисел в ЭВМ?",
    currectAnswer: [
      "Через множественные операции сравнения меньших частей чисел",
    ],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Через множественные операции сравнения меньших частей чисел",
      "Путем прямого сравнения полных значений",
      "С использованием специального алгоритма упрощения",
      "Путем преобразования в более мелкие единицы и последующего сравнения",
    ],
  },
  {
    title: "Что такое непосредственное сравнение?",
    currectAnswer: [
      "Сравнение, которое не требует предварительной обработки данных",
    ],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Сравнение, при котором используются внешние устройства",
      "Сравнение, которое не требует предварительной обработки данных",
      "Сравнение, включающее в себя несколько промежуточных шагов",
      "Сравнение, проводимое вне процессора",
    ],
  },
  {
    title:
      "Какие проблемы могут возникнуть при сравнении чисел в многопоточных приложениях?",
    currectAnswer: [
      "Гонки и условия состязания из-за одновременного доступа к данным",
    ],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Все потоки могут сравнивать числа одинаково быстро",
      "Гонки и условия состязания из-за одновременного доступа к данным",
      "Сравнение в многопоточных приложениях невозможно",
      "Потоки не могут использовать одни и те же методы сравнения",
    ],
  },
  {
    title:
      "Каковы могут быть последствия неправильной реализации сравнения чисел в программном обеспечении?",
    currectAnswer: [
      "Некорректная работа программы, возможно приведение к сбоям",
    ],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Никаких последствий не будет",
      "Некорректная работа программы, возможно приведение к сбоям",
      "Увеличение производительности программы",
      "Автоматическое исправление ошибок в программе",
    ],
  },
  {
    title: "Как сравнение чисел влияет на алгоритмы сортировки?",
    currectAnswer: [
      "Является ключевым компонентом, определяющим порядок элементов",
    ],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Никак не влияет, поскольку сортировка не требует сравнения",
      "Является ключевым компонентом, определяющим порядок элементов",
      "Используется только в некоторых типах сортировки",
      "Замедляет процесс сортировки",
    ],
  },
  {
    title:
      "Какие специализированные инструкции для сравнения чисел присутствуют в современных процессорах?",
    currectAnswer: [
      "Инструкции для сравнения целых чисел, чисел с плавающей запятой и векторных данных",
    ],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Инструкции для сравнения только целых чисел",
      "Инструкции для сравнения целых чисел, чисел с плавающей запятой и векторных данных",
      "Только инструкции для работы с текстовыми данными",
      "Инструкции, которые не позволяют сравнивать числа",
    ],
  },
  {
    title:
      "Что такое флаг переполнения и как он может быть связан с операциями сравнения?",
    currectAnswer: [
      "Показывает, что в результате операции, возможно включая сравнение, произошло переполнение",
    ],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Индикатор ошибки в вычислениях, не связан с сравнением",
      "Показывает, что в результате операции, возможно включая сравнение, произошло переполнение",
      "Указывает на успешное выполнение сравнения",
      "Отображает количество выполненных операций сравнения",
    ],
  },
];

export const ramTest: IQuestion[] = [
  {
    title: "Что такое ОЗУ?",
    currectAnswer: [
      "ОЗУ — это оперативная память, используемая для временного хранения данных во время работы компьютера.",
    ],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "ОЗУ — это устройство для хранения файлов на жестком диске.",
      "ОЗУ — это место, где хранятся все программы на компьютере.",
      "ОЗУ — это оперативная память, используемая для временного хранения данных во время работы компьютера.",
      "ОЗУ — это видеокарта, отвечающая за графику.",
    ],
  },
  {
    title: "Какие основные характеристики отдельных ЗУ ОЗУ?",
    currectAnswer: [
      "Емкость памяти, быстродействие и стоимость хранения единицы информации.",
    ],
    quantityOfAnswers: 3,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Емкость памяти, быстродействие и стоимость хранения единицы информации.",
      "Цвет, форма и размер.",
      "Пропускная способность и энергопотребление.",
    ],
  },
  {
    title: "Что определяет быстродействие ОЗУ?",
    currectAnswer: ["Время доступа и длительность цикла памяти."],
    quantityOfAnswers: 3,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Время доступа и длительность цикла памяти.",
      "Емкость памяти и стоимость хранения.",
      "Тип используемых программ.",
    ],
  },
  {
    title: "Какие уровни иерархии памяти существуют в ЭВМ?",
    currectAnswer: ["Сверхоперативная, оперативная и внешняя память."],
    quantityOfAnswers: 3,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Сверхоперативная, оперативная и внешняя память.",
      "Регистры, кэш-память и внешняя память.",
      "Оперативная, виртуальная и внешняя память.",
    ],
  },
  {
    title: "Что является частью системы компьютерной памяти?",
    currectAnswer: ["Оперативная память."],
    quantityOfAnswers: 3,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Внешняя память.",
      "Оперативная память.",
      "Сверхоперативная память.",
    ],
  },
  {
    title: "Что хранится в ОЗУ?",
    currectAnswer: [
      "Выполняемые в данный момент программы и обрабатываемые данные.",
    ],
    quantityOfAnswers: 3,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Долгосрочные данные.",
      "Выполняемые в данный момент программы и обрабатываемые данные.",
      "Резидентные программы.",
    ],
  },
  {
    title: "Какие типы ОЗУ существуют?",
    currectAnswer: ["SRAM и DRAM"],
    quantityOfAnswers: 3,
    isSeveralAnswers: false,
    variantsOfAnswer: ["SRAM и DRAM", "HDD и SSD", "Flash-память и CD-ROM."],
  },
  {
    title: "Что такое “память с ECC” в контексте ОЗУ?",
    currectAnswer: ["Память с контролем ошибок (Error-Correcting Code)."],
    quantityOfAnswers: 3,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Память с расширенным цветовым кодированием.",
      "Память с контролем ошибок (Error-Correcting Code).",
      "Память с увеличенной емкостью.",
    ],
  },
  {
    title: "Как происходит доступ к данным в оперативной памяти?",
    currectAnswer: ["Путем чтения и записи электрических сигналов."],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Через магнитные диски.",
      "Путем чтения и записи электрических сигналов.",
      "С помощью оптических накопителей.",
      "По радиоволнам.",
    ],
  },
  {
    title: "Что такое ОЗУ в контексте ЭВМ?",
    currectAnswer: ["Оперативное запоминающее устройство"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Оперативное запоминающее устройство",
      "Основное запоминающее устройство",
      "Операционное зарядное устройство",
      "Организационное запоминающее устройство",
    ],
  },
  {
    title: "Какова основная функция ОЗУ?",
    currectAnswer: [
      "Временное хранение данных и программ для быстрого доступа",
    ],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Хранение данных на постоянной основе",
      "Временное хранение данных и программ для быстрого доступа",
      "Управление процессами компьютера",
      "Хранение больших объемов информации",
    ],
  },
  {
    title: 'Что означает термин "оперативная память"?',
    currectAnswer: [
      "Память для временного хранения и быстрого доступа к данным",
    ],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Память, которая работает только при наличии операционной системы",
      "Память для временного хранения и быстрого доступа к данным",
      "Память, которая управляется напрямую процессором",
      "Память, предназначенная для хранения системных файлов",
    ],
  },
  {
    title: "Какие типы ОЗУ существуют?",
    currectAnswer: ["DRAM и SRAM"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "DRAM и SRAM",
      "HDD и SSD",
      "ROM и PROM",
      "EPROM и EEPROM",
    ],
  },
  {
    title: "Чем отличается DRAM от SRAM?",
    currectAnswer: [
      "DRAM требует регулярной перезарядки, в то время как SRAM - нет",
    ],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "DRAM требует регулярной перезарядки, в то время как SRAM - нет",
      "SRAM быстрее и требует перезарядки, DRAM медленнее и не требует перезарядки",
      "DRAM используется для постоянного хранения, SRAM для временного",
      "SRAM используется в видеокартах, DRAM в жестких дисках",
    ],
  },
  {
    title: "Какой принцип работы у ОЗУ?",
    currectAnswer: ["Хранение данных с возможностью чтения и записи"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Хранение данных с возможностью только чтения",
      "Хранение данных с возможностью чтения и записи",
      "Запись данных без возможности чтения",
      "Хранение данных без возможности изменения",
    ],
  },
  {
    title: "Что происходит с данными в ОЗУ при отключении питания?",
    currectAnswer: ["Данные теряются"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Данные сохраняются на неопределенное время",
      "Данные теряются",
      "Данные автоматически переносятся на жесткий диск",
      "Данные зашифровываются и сохраняются",
    ],
  },
  {
    title: "Для чего используется кэш-память процессора в контексте ОЗУ?",
    currectAnswer: [
      "Для ускорения доступа к наиболее часто используемым данным",
    ],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Для ускорения доступа к наиболее часто используемым данным",
      "Для увеличения общего объема доступной памяти",
      "Для хранения данных, которые нельзя изменять",
      "Для замедления процесса чтения данных, чтобы избежать ошибок",
    ],
  },
  {
    title: "Какое устройство управляет распределением и использованием ОЗУ?",
    currectAnswer: ["Микропроцессор"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Жесткий диск",
      "Операционная система",
      "Микропроцессор",
      "Блок питания",
    ],
  },
  {
    title: "Чем характеризуется высокопроизводительное ОЗУ?",
    currectAnswer: ["Низкая задержка и высокая частота"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Низкая задержка и высокая частота",
      "Большой объем и низкая стоимость",
      "Высокая стоимость и большой размер",
      "Низкая энергоэффективность и высокая стоимость",
    ],
  },
  {
    title: "Как влияет увеличение объема ОЗУ на производительность компьютера?",
    currectAnswer: ["Позволяет одновременно запускать больше программ"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Позволяет одновременно запускать больше программ",
      "Уменьшает время отклика системы",
      "Уменьшает энергопотребление",
      "Повышает скорость интернет-соединения",
    ],
  },
  {
    title: "Что такое виртуальная память?",
    currectAnswer: ["Часть жесткого диска, используемая как ОЗУ"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Дополнительный жесткий диск",
      "Часть жесткого диска, используемая как ОЗУ",
      "Программное обеспечение для управления памятью",
      "Специализированный процессор для обработки данных",
    ],
  },
  {
    title: "Какова роль адресной шины в контексте ОЗУ?",
    currectAnswer: [
      "Определение адреса ячейки памяти, с которой процессор должен взаимодействовать",
    ],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Передача данных между процессором и ОЗУ",
      "Определение адреса ячейки памяти, с которой процессор должен взаимодействовать",
      "Управление питанием для ОЗУ",
      "Кодирование информации перед ее записью в ОЗУ",
    ],
  },
  {
    title: "Что такое двухканальный режим в ОЗУ?",
    currectAnswer: [
      "Повышение производительности за счет параллельной работы двух модулей памяти",
    ],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Использование двух разных типов ОЗУ одновременно",
      "Повышение производительности за счет параллельной работы двух модулей памяти",
      "Резервирование одного модуля ОЗУ для системных нужд",
      "Автоматическое переключение между двумя модулями ОЗУ",
    ],
  },
  {
    title: "Каковы типичные размеры модулей ОЗУ современных ПК?",
    currectAnswer: ["4-32 ГБ"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: ["1-2 ГБ", "4-32 ГБ", "64-128 ГБ", "256-512 ГБ"],
  },
  {
    title: "Что такое тайминги памяти?",
    currectAnswer: ["Параметры, определяющие задержки в работе памяти"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Параметры, определяющие задержки в работе памяти",
      "Максимальное время сохранения данных без питания",
      "Время необходимое для установки модуля памяти",
      "Продолжительность цикла чтения-записи",
    ],
  },
  {
    title: "Какой параметр ОЗУ указывает на его скорость?",
    currectAnswer: ["Частота"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Емкость",
      "Частота",
      "Размер модуля",
      "Бренд производителя",
    ],
  },
  {
    title: "Как DDR4 отличается от DDR3?",
    currectAnswer: ["Выше скорость и эффективность, ниже энергопотребление"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Выше скорость и эффективность, ниже энергопотребление",
      "Ниже скорость, но лучше совместимость",
      "Больше емкость, но выше цена",
      "Меньше функциональных возможностей, но ниже стоимость",
    ],
  },
  {
    title: "Какие факторы влияют на производительность ОЗУ?",
    currectAnswer: ["Частота, тайминги и тип памяти"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Только тип памяти",
      "Частота, тайминги и тип памяти",
      "Только размер модуля",
      "Только производитель чипа",
    ],
  },
  {
    title: "Что такое ECC в ОЗУ?",
    currectAnswer: ["Память с коррекцией ошибок"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Расширенная конфигурация кэша",
      "Память с коррекцией ошибок",
      "Дополнительная криптографическая функция",
      "Внешний контроллер памяти",
    ],
  },
  {
    title: "Как технология overclocking влияет на ОЗУ?",
    currectAnswer: [
      "Повышает частоту работы памяти за пределами заводских настроек",
    ],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Повышает частоту работы памяти за пределами заводских настроек",
      "Снижает скорость работы памяти для уменьшения энергопотребления",
      "Автоматически адаптирует память к условиям работы",
      "Расширяет физический объем памяти",
    ],
  },
  {
    title: "Как функционирует синхронная DRAM?",
    currectAnswer: [
      "Синхронизируется с системной шиной для управления временем доступа",
    ],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Синхронизируется с системной шиной для управления временем доступа",
      "Работает независимо от системной шины",
      "Использует внешние сигналы для управления доступом",
      "Не требует синхронизации для работы",
    ],
  },
  {
    title: "Каковы преимущества использования SRAM по сравнению с DRAM?",
    currectAnswer: ["Быстрее, но дороже и используется для кэш-памяти"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Большая емкость и дешевизна",
      "Быстрее, но дороже и используется для кэш-памяти",
      "Более надежна для долгосрочного хранения",
      "Легче интегрируется с другими компонентами системы",
    ],
  },
  {
    title:
      "Какие проблемы могут возникнуть из-за несовместимости ОЗУ с материнской платой?",
    currectAnswer: ["Нестабильная работа системы или невозможность загрузки"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Нестабильная работа системы или невозможность загрузки",
      "Повышенное энергопотребление",
      "Уменьшение общей производительности ПК",
      "Повреждение компонентов системы из-за перегрева",
    ],
  },
  {
    title: "Как влияет размер шины данных на производительность ОЗУ?",
    currectAnswer: [
      "Шире шина, выше пропускная способность и быстрее передача данных",
    ],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Шире шина, выше пропускная способность и быстрее передача данных",
      "Размер шины не влияет на производительность",
      "Уменьшенная ширина шины увеличивает скорость передачи",
      "Ширина шины влияет только на потребление энергии",
    ],
  },
  {
    title: "Что такое многоканальный режим в ОЗУ?",
    currectAnswer: [
      "Использование нескольких каналов памяти для увеличения пропускной способности",
    ],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Использование нескольких каналов памяти для увеличения пропускной способности",
      "Использование ОЗУ разных производителей",
      "Автоматическое переключение между каналами для экономии энергии",
      "Режим, при котором ОЗУ может работать с несколькими процессорами одновременно",
    ],
  },
  {
    title: "Как модули ОЗУ влияют на многозадачность компьютера?",
    currectAnswer: [
      "Больше ОЗУ позволяет эффективнее переключаться между задачами",
    ],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Больше ОЗУ позволяет эффективнее переключаться между задачами",
      "Никак не влияет, поскольку многозадачность зависит только от процессора",
      "Уменьшает количество задач, которые можно выполнить одновременно",
      "Зависит только от скорости ОЗУ, а не от его объема",
    ],
  },
  {
    title: "Какое влияние на ОЗУ оказывает его частота?",
    currectAnswer: ["Выше частота, быстрее обработка данных"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Выше частота, быстрее обработка данных",
      "Низкая частота улучшает стабильность системы",
      "Частота влияет только на время загрузки компьютера",
      "Высокая частота может привести к перегреву компонентов",
    ],
  },
  {
    title: "Что происходит при заполнении всей доступной ОЗУ?",
    currectAnswer: [
      "Система использует виртуальную память на жестком диске для расширения",
    ],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Система использует виртуальную память на жестком диске для расширения",
      "Компьютер автоматически увеличивает объем ОЗУ",
      "Система блокируется до освобождения памяти",
      "Снижается только скорость интернет-соединения",
    ],
  },
  {
    title: "Как процесс загрузки операционной системы связан с ОЗУ?",
    currectAnswer: [
      "Операционная система загружается в ОЗУ при старте компьютера",
    ],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Операционная система загружается непосредственно из ROM",
      "Операционная система загружается в ОЗУ при старте компьютера",
      "ОЗУ только хранит данные, необходимые для загрузки",
      "Никак не связан, поскольку ОЗУ используется после загрузки ОС",
    ],
  },
];

export const cacheTest: IQuestion[] = [
  {
    title: "Что такое кэш-память в компьютере?",
    currectAnswer: ["Временное хранилище для часто используемых данных."],
    quantityOfAnswers: 3,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Временное хранилище для часто используемых данных.",
      "Память для хранения файлов.",
      "Оперативная память.",
    ],
  },
  {
    title: "Какие типы кэш-памяти существуют?",
    currectAnswer: ["L1, L2, L3."],
    quantityOfAnswers: 3,
    isSeveralAnswers: false,
    variantsOfAnswer: ["L1, L2, L3.", "RAM, ROM, HDD.", "Flash, SSD, CD."],
  },
  {
    title: "Для чего используется кэш-память в ЭВМ?",
    currectAnswer: ["Ускорение доступа к данным."],
    quantityOfAnswers: 3,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Ускорение доступа к данным.",
      "Хранение всех данных на постоянной основе.",
      "Увеличение объема оперативной памяти.",
    ],
  },
  {
    title: "Какой уровень кэша обычно находится ближе всего к процессору?",
    currectAnswer: ["L1."],
    quantityOfAnswers: 3,
    isSeveralAnswers: false,
    variantsOfAnswer: ["L1.", "L2.", "L3."],
  },
  {
    title: "Какая память обычно самая быстрая: кэш или оперативная?",
    currectAnswer: ["Кэш."],
    quantityOfAnswers: 3,
    isSeveralAnswers: false,
    variantsOfAnswer: ["Кэш.", "Оперативная.", "Они одинаково быстрые."],
  },
  {
    title: "Какие преимущества дает использование кэш-памяти в ЭВМ?",
    currectAnswer: ["Увеличение скорости работы процессора."],
    quantityOfAnswers: 3,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Увеличение скорости работы процессора.",
      "Снижение объема оперативной памяти.",
      "Увеличение размера жесткого диска.",
    ],
  },
  {
    title: "Какие недостатки могут быть у кэш-памяти?",
    currectAnswer: ["Ограниченный объем."],
    quantityOfAnswers: 3,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Ограниченный объем.",
      "Высокая стоимость.",
      "Замедление работы процессора.",
    ],
  },
  {
    title:
      "Какая из перечисленных памятей является наиболее близкой к процессору?",
    currectAnswer: ["Кэш-память L1."],
    quantityOfAnswers: 3,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Кэш-память L1.",
      "Кэш-память L2.",
      "Оперативная память RAM.",
    ],
  },
  {
    title: "Какие данные обычно хранятся в кэш-памяти?",
    currectAnswer: ["Недавно использованные данные."],
    quantityOfAnswers: 3,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Все данные программы.",
      "Недавно использованные данные.",
      "Операционная система.",
    ],
  },
  {
    title:
      "Какие еще устройства помимо процессоров могут использовать кэш-память для оптимизации работы?",
    currectAnswer: ["Графические карты."],
    quantityOfAnswers: 3,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Сетевые адаптеры.",
      "Жесткие диски.",
      "Графические карты.",
    ],
  },
  {
    title: "Что такое кэш в ЭВМ?",
    currectAnswer: [
      "Быстрая память для временного хранения часто используемых данных",
    ],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Быстрая память для временного хранения часто используемых данных",
      "Основная память компьютера",
      "Внешнее хранилище данных",
      "Медленная память для долговременного хранения данных",
    ],
  },
  {
    title: "Какой тип кэша наиболее часто используется в процессорах?",
    currectAnswer: ["Кэш процессора (CPU cache)"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Дисковый кэш",
      "Кэш браузера",
      "Кэш процессора (CPU cache)",
      "Кэш видеопамяти",
    ],
  },
  {
    title: "Как называется первый уровень кэша в процессоре?",
    currectAnswer: ["L1"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: ["L3", "L1", "L2", "L4"],
  },
  {
    title: "Как называется второй уровень кэша в процессоре?",
    currectAnswer: ["L2"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: ["L1", "L2", "L3", "L4"],
  },
  {
    title: "Какой тип кэша обычно делится между несколькими ядрами процессора?",
    currectAnswer: ["L3"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: ["L1", "L2", "L3", "L4"],
  },
  {
    title: "Какой параметр определяет скорость кэша?",
    currectAnswer: ["Время доступа"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Размер кэша",
      "Время доступа",
      "Частота обновления",
      "Ёмкость памяти",
    ],
  },
  {
    title: 'Что означает "кэш-попадание" (cache hit)?',
    currectAnswer: ["Данные найдены в кэше"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Данные найдены в кэше",
      "Данные не найдены в кэше",
      "Ошибка при доступе к кэшу",
      "Переполнение кэша",
    ],
  },
  {
    title: 'Что означает "кэш-промах" (cache miss)?',
    currectAnswer: ["Данные не найдены в кэше"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Данные найдены в кэше",
      "Данные не найдены в кэше",
      "Ошибка при записи в кэш",
      "Обновление данных в кэше",
    ],
  },
  {
    title: "Какой метод используется для управления кэшем?",
    currectAnswer: ["LRU (Least Recently Used)"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "FIFO",
      "LRU (Least Recently Used)",
      "LIFO",
      "LRF (Least Recently Found)",
    ],
  },
  {
    title: "Что происходит при кэш-промахе?",
    currectAnswer: ["Процессор обращается к основной памяти за данными"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Процессор продолжает работу без изменений",
      "Данные удаляются из кэша",
      "Процессор обращается к основной памяти за данными",
      "Процессор перезагружается",
    ],
  },
  {
    title:
      "Какой тип кэширования используется для уменьшения латентности доступа к данным?",
    currectAnswer: ["Инструкционное кэширование"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Инструкционное кэширование",
      "Дисковое кэширование",
      "Веб-кэширование",
      "Видео-кэширование",
    ],
  },
  {
    title: "Какой уровень кэша обычно имеет самый большой объем?",
    currectAnswer: ["L3"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: ["L1", "L2", "L3", "L4"],
  },
  {
    title: "Что такое write-back кэш?",
    currectAnswer: [
      "Кэш, который обновляет данные в основной памяти только при замене данных в кэше",
    ],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Кэш, который обновляет данные в основной памяти только при замене данных в кэше",
      "Кэш, который немедленно записывает данные в основную память",
      "Кэш, который не сохраняет данные",
      "Кэш, который всегда чистится после использования",
    ],
  },
  {
    title: "Что такое write-through кэш?",
    currectAnswer: [
      "Кэш, который немедленно записывает данные в основную память",
    ],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Кэш, который никогда не обновляет данные",
      "Кэш, который немедленно записывает данные в основную память",
      "Кэш, который обновляет данные только при замене",
      "Кэш, который сохраняет данные только в кэше",
    ],
  },
  {
    title: "Какой из следующих уровней кэша самый быстрый?",
    currectAnswer: ["L1"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: ["L1", "L2", "L3", "L4"],
  },
  {
    title: "Какой алгоритм используется для замены данных в кэше?",
    currectAnswer: ["LRU (Least Recently Used)"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "FIFO",
      "LIFO",
      "LRU (Least Recently Used)",
      "MRU (Most Recently Used)",
    ],
  },
  {
    title: "Что такое k-way set associative кэш?",
    currectAnswer: [
      "Кэш, где каждая ячейка может быть помещена в одну из k позиций",
    ],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Кэш, где каждая ячейка может быть помещена в одну из k позиций",
      "Кэш, где данные хранятся только в одной позиции",
      "Кэш, где данные всегда заменяются в FIFO порядке",
      "Кэш, где данные хранятся в случайных позициях",
    ],
  },
  {
    title: "Какой механизм используется для предсказания кэш-промахов?",
    currectAnswer: ["Prefetching (предвыборка данных)"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "FIFO",
      "Prefetching (предвыборка данных)",
      "LIFO",
      "Write-back",
    ],
  },
  {
    title: "Что такое кэш-консистентность?",
    currectAnswer: [
      "Обеспечение согласованности данных между кэшем и основной памятью",
    ],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Обеспечение согласованности данных между кэшем и основной памятью",
      "Удаление данных из кэша",
      "Постоянное обновление кэша",
      "Уменьшение размера кэша",
    ],
  },
  {
    title:
      "Какой тип кэша используется в сетевых устройствах для ускорения доступа к данным?",
    currectAnswer: ["Веб-кэш"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: ["Веб-кэш", "Видеокэш", "Кэш процессора", "Дисковый кэш"],
  },
  {
    title: "Что такое кэш-линия?",
    currectAnswer: ["Минимальная единица данных, хранимая в кэше"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Последовательность инструкций в кэше",
      "Объем кэша",
      "Минимальная единица данных, хранимая в кэше",
      "Интервал времени, в течение которого данные находятся в кэше",
    ],
  },
  {
    title:
      "Какое преимущество имеет кэширование перед прямым доступом к основной памяти?",
    currectAnswer: ["Более высокая скорость доступа к данным"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Больший объем хранения",
      "Более высокая скорость доступа к данным",
      "Меньшие затраты на производство",
      "Более простая архитектура",
    ],
  },
  {
    title:
      "Какой тип кэша используется для хранения часто используемых веб-страниц?",
    currectAnswer: ["Веб-кэш"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: ["Веб-кэш", "Дисковый кэш", "Кэш процессора", "Видеокэш"],
  },
  {
    title: 'Что такое директива "cache-control" в HTTP?',
    currectAnswer: ["Указание, как и когда кэшировать данные веб-страниц"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Команда на очистку кэша",
      "Указание, как и когда кэшировать данные веб-страниц",
      "Указание на обновление кэша",
      "Команда на запись данных в кэш",
    ],
  },
  {
    title:
      "Какой тип кэша помогает уменьшить время загрузки приложений на компьютере?",
    currectAnswer: ["Дисковый кэш"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Кэш браузера",
      "Дисковый кэш",
      "Видеокэш",
      "Кэш процессора",
    ],
  },
  {
    title: "Что такое инклюзивный кэш?",
    currectAnswer: ["Кэш, который включает данные из других уровней кэша"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Кэш, который содержит только уникальные данные",
      "Кэш, который не содержит данные из других уровней",
      "Кэш, который включает данные из других уровней кэша",
      "Кэш, который всегда обновляется",
    ],
  },
  {
    title: "Что такое эксклюзивный кэш?",
    currectAnswer: ["Кэш, который не дублирует данные из других уровней кэша"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Кэш, который содержит только уникальные данные",
      "Кэш, который не дублирует данные из других уровней кэша",
      "Кэш, который всегда обновляется",
      "Кэш, который содержит все данные из основной памяти",
    ],
  },
  {
    title: "Какой тип кэша используется в графических процессорах (GPU)?",
    currectAnswer: ["Кэш текстур (Texture cache)"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Кэш браузера",
      "Дисковый кэш",
      "Веб-кэш",
      "Кэш текстур (Texture cache)",
    ],
  },
  {
    title: 'Что такое "cold cache"?',
    currectAnswer: ["Кэш, который не содержит данных после инициализации"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Кэш с высокой температурой",
      "Кэш, который не содержит данных после инициализации",
      "Кэш, который всегда заполнен",
      "Кэш, который содержит устаревшие данные",
    ],
  },
  {
    title: 'Что такое "warm cache"?',
    currectAnswer: ["Кэш, который содержит часто используемые данные"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Кэш с высокой температурой",
      "Кэш, который содержит часто используемые данные",
      "Кэш, который всегда пуст",
      "Кэш, который не используется",
    ],
  },
];

export const dramTest: IQuestion[] = [
  {
    title: "Что означает аббревиатура DRAM?",
    currectAnswer: ["Dynamic Read Access Memory"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Direct Random Access Memory",
      "Dynamic Random Access Memory",
      "Digital Random Access Memory",
      "Dynamic Read Access Memory",
    ],
  },
  {
    title: "Какова основная функция DRAM?",
    currectAnswer: ["Временное хранение данных"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Хранение данных на долгий срок",
      "Временное хранение данных",
      "Обработка данных",
      "Управление вводом-выводом данных",
    ],
  },
  {
    title: "Что необходимо для поддержания данных в DRAM?",
    currectAnswer: ["Постоянное обновление (refresh)"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Постоянное обновление (refresh)",
      "Низкое напряжение",
      "Высокая температура",
      "Вентиляция",
    ],
  },
  {
    title: "Как часто происходит обновление ячеек в DRAM?",
    currectAnswer: ["Каждые несколько миллисекунд"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Раз в минуту",
      "Раз в час",
      "Каждые несколько миллисекунд",
      "Раз в день",
    ],
  },
  {
    title: "Какую структуру использует DRAM для хранения данных?",
    currectAnswer: ["Конденсатор и транзистор"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Транзисторы и конденсаторы",
      "Регистрирующие ячейки",
      "Конденсатор и транзистор",
      "Магнитные пластины",
    ],
  },
  {
    title: "Почему DRAM требует обновления?",
    currectAnswer: ["Из-за утечки заряда конденсаторов"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Из-за постоянных ошибок",
      "Из-за утечки заряда конденсаторов",
      "Из-за высокой температуры",
      "Из-за перегрева транзисторов",
    ],
  },
  {
    title:
      "Как называется время, необходимое для чтения или записи данных в DRAM?",
    currectAnswer: ["Время доступа"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Время задержки",
      "Время доступа",
      "Время выполнения",
      "Время хранения",
    ],
  },
  {
    title: "Какое напряжение обычно используется для работы DRAM?",
    currectAnswer: ["1.2-1.5 В"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: ["12 В", "1.2-1.5 В", "5 В", "9 В"],
  },
  {
    title: "Какой из ниже перечисленных типов памяти является энергозависимым?",
    currectAnswer: ["DRAM"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: ["SRAM", "ROM", "DRAM", "Flash"],
  },
  {
    title: "Как называется процесс разрядки и зарядки конденсаторов в DRAM?",
    currectAnswer: ["Обновление (refresh)"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Перепрограммирование",
      "Перезагрузка",
      "Пересчет",
      "Обновление (refresh)",
    ],
  },
  {
    title:
      "Какой из ниже перечисленных типов памяти имеет наивысшую плотность хранения?",
    currectAnswer: ["DRAM"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: ["DRAM", "SRAM", "ROM", "Cache"],
  },
  {
    title:
      "Какова основная причина использования DRAM в системной памяти компьютера?",
    currectAnswer: ["Высокая плотность и низкая стоимость"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Высокая скорость",
      "Долговечность",
      "Высокая плотность и низкая стоимость",
      "Энергонезависимость",
    ],
  },
  {
    title: "Какое время доступа характерно для современной DRAM?",
    currectAnswer: ["50-70 наносекунд"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "1-2 секунды",
      "1-2 миллисекунды",
      "50-70 наносекунд",
      "10-20 микросекунд",
    ],
  },
  {
    title: "Какой тип памяти быстрее?",
    currectAnswer: ["SRAM"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: ["SRAM", "DRAM", "ROM", "Flash"],
  },
  {
    title: "Как называется время, необходимое для обновления всех ячеек DRAM?",
    currectAnswer: ["Интервал обновления (refresh interval)"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Цикл обновления",
      "Интервал обновления (refresh interval)",
      "Время чтения",
      "Время записи",
    ],
  },
  {
    title:
      "Какой из ниже перечисленных компонентов входит в состав DRAM ячейки?",
    currectAnswer: ["Один транзистор и один конденсатор"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Два транзистора",
      "Два конденсатора",
      "Один транзистор и один конденсатор",
      "Три транзистора",
    ],
  },
  {
    title: "Что определяет количество энергии, потребляемой DRAM?",
    currectAnswer: [""],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Число ячеек памяти",
      "Частота обновления и напряжение питания",
      "Тип процессора",
      "Операционная система",
    ],
  },
  {
    title: "Какая технология позволяет уменьшить энергопотребление DRAM?",
    currectAnswer: ["Использование низковольтной DRAM (LVDRAM)"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Увеличение количества транзисторов",
      "Использование низковольтной DRAM (LVDRAM)",
      "Увеличение размера ячеек",
      "Понижение температуры",
    ],
  },
  {
    title:
      "Как называется техника, используемая для повышения производительности DRAM?",
    currectAnswer: ["Разбивка на банки (bank interleaving)"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Кеширование",
      "Разделение данных",
      "Разбивка на банки (bank interleaving)",
      "Сжимающее кодирование",
    ],
  },
  {
    title:
      "Какой из ниже перечисленных типов DRAM был разработан для повышения скорости работы?",
    currectAnswer: ["DDR SDRAM"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Synchronous DRAM (SDRAM)",
      "Double Data Rate DRAM (DDR DRAM)",
      "DDR SDRAM",
      "DRDRAM",
    ],
  },
  {
    title: "Какая технология позволила увеличить пропускную способность DRAM?",
    currectAnswer: [
      "Использование технологии двойной скорости передачи данных (DDR)",
    ],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Увеличение количества транзисторов",
      "Использование технологии двойной скорости передачи данных (DDR)",
      "Увеличение размера ячеек",
      "Понижение напряжения",
    ],
  },
  {
    title: "Как называется часть DRAM, где хранятся текущие операции?",
    currectAnswer: ["Банки памяти"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: ["Регистры", "Кеш", "Банки памяти", "Буфер"],
  },
  {
    title:
      "Какой параметр определяет количество данных, которые могут быть переданы за один цикл?",
    currectAnswer: ["Ширина шины данных"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Ширина шины данных",
      "Частота обновления",
      "Время доступа",
      "Время задержки",
    ],
  },
  {
    title: "Какая технология позволяет DRAM работать синхронно с процессором?",
    currectAnswer: ["Synchronous DRAM (SDRAM)"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Synchronous DRAM (SDRAM)",
      "Asynchronous DRAM (ADRAM)",
      "Static DRAM (SDRAM)",
      "Dynamic DRAM (DDRAM)",
    ],
  },
  {
    title:
      "Какой тип памяти DRAM используется в современных графических картах?",
    currectAnswer: ["GDDR"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: ["DDR SDRAM", "LPDDR", "GDDR", "SDR SDRAM"],
  },
  {
    title:
      "Какой тип DRAM используется в мобильных устройствах для снижения энергопотребления?",
    currectAnswer: ["LPDDR"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: ["DDR SDRAM", "GDDR", "LPDDR", "SDR SDRAM"],
  },
  {
    title: 'Что такое "буферный DRAM" (Buffered DRAM)?',
    currectAnswer: ["DRAM с буфером для улучшения сигналов"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "DRAM с дополнительной кэш-памятью",
      "DRAM с буфером для улучшения сигналов",
      "DRAM с уменьшенным временем доступа",
      "DRAM с увеличенным временем обновления",
    ],
  },
  {
    title:
      "Какой тип DRAM наиболее распространен в современных персональных компьютерах?",
    currectAnswer: ["DDR4 SDRAM"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: ["SDR SDRAM", "DDR4 SDRAM", "RDRAM", "LPDDR3"],
  },
  {
    title: "Какая технология используется для предотвращения ошибок в DRAM?",
    currectAnswer: ["ECC (Error-Correcting Code)"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Кеширование",
      "Буферизация",
      "ECC (Error-Correcting Code)",
      "Разделение данных",
    ],
  },
  {
    title:
      "Какой параметр указывает на задержку между командами чтения и записи в DRAM?",
    currectAnswer: ["CAS латентность (Column Address Strobe latency)"],
    quantityOfAnswers: 4,
    isSeveralAnswers: false,
    variantsOfAnswer: [
      "Время обновления",
      "Время выполнения",
      "CAS латентность (Column Address Strobe latency)",
      "Время доступа",
    ],
  },
];
